# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
series1 = pd.Series(np.random.randint(1, 5, 100))
series2 = pd.Series(np.random.randint(1, 4, 100))
series3 = pd.Series(np.random.randint(10000, 40000, 100))
series1.head()

0    2
1    4
2    2
3    4
4    2
dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df = pd.concat([series1, series2, series3], axis=1)
df.head()

   0  1      2
0  2  2  32062
1  4  1  15618
2  2  2  27485
3  4  2  38899
4  2  2  37159

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
# My original answer:
# df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
# df.head()
df.rename(columns = {0: 'bedrs', 1:'bathrs', 2:'price_sqr_meter'}, inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            32062
1      4       1            15618
2      2       2            27485
3      4       2            38899
4      2       2            37159

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
# bigcolumn will remain a series unless converted to a df
# Let's convert to a data frame
bigcolumn = pd.concat([series1, series2, series3], axis=0).to_frame()

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [6]:
bigcolumn.tail()

        0
95  29331
96  38841
97  34507
98  16503
99  12548

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [7]:
# My original answer:
# bigcolumn.index = range(len(bigcolumn))

bigcolumn.reset_index(drop=True, inplace=True)

In [8]:
bigcolumn.tail()

         0
295  29331
296  38841
297  34507
298  16503
299  12548